FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1768/LPC1768_USBDeviceController.c
    // Handle endpoints with data on them
    for (i = 0; i < 32; i++) {
        if (LPC_USB->USBEpIntSt & (1<<i)) {
            // Clear the interrupt flag
            LPC_USB->USBEpIntClr = (1<<i);

            if (p_dev) {
                // Be sure wait for a command to be available
                IWaitForDeviceInterrupt(p, CDFULL);

                // Get the end point's status
                endpointStatus = LPC_USB->USBCmdData;

                // Call the end point handler
                if (i & 1)  {
    dprintf("\n[IN%d]", i>>1);
                    if (p_dev->iEndpointFuncs[i>>1].iIn) {
                        p_dev->iEndpointFuncs[i>>1].iIn(
                            p_dev->iCallbackWorkspace,
                            IIndexToEndpoint(i),
                            endpointStatus);
                    } else {
                        // TBD: Clear the endpoint?
                    }
                } else {
    dprintf("\n[OUT%d]", i>>1);
                    if (p_dev->iEndpointFuncs[i>>1].iOut) {
                        p_dev->iEndpointFuncs[i>>1].iOut(
                            p_dev->iCallbackWorkspace,
                            IIndexToEndpoint(i),
                            endpointStatus);
                    } else {
                        // TBD: Clear the endpoint?
                    }
                }
            }
        }
    }

    // Ensure the interrupts are back on
    InterruptEnable(USB_IRQn);
}

/*---------------------------------------------------------------------------*
 * Routine:  ILPC1768_USBDev_InterruptVector
 *---------------------------------------------------------------------------*
 * Description:
 *      Process USB Device Interrupts
 *---------------------------------------------------------------------------*/
void LPC1768_InterruptProcess_USBDevice(void)
{
    if (G_LPC1768_USBDev_Workspace)
        ILPC1768_USBDev_InterruptProcess(G_LPC1768_USBDev_Workspace);
}

/*-------------------------------------------------------------------------*
 * Function:  LPC1768_USBDev_Connect
 *-------------------------------------------------------------------------*
 * Description:
 *      Connect to the USB bus.
 * Inputs:
 *      void *aWorkspace          -- USBDev Controller's workspace
 *-------------------------------------------------------------------------*/
static void LPC1768_USBDev_Connect(void *aWorkspace)
{
    ILPC1768_USBDev_CommandAndWrite(
        (T_LPC1768_USBDev_Workspace *)aWorkspace,
        USB_DEVICE_CMD_STATUS,
        USB_STATUS_CONNECT);
}

/*-------------------------------------------------------------------------*
 * Function:  LPC1768_USBDev_Disconnect
 *-------------------------------------------------------------------------*
 * Description:
 *      Disconnect from the USB bus.
 * Inputs:
 *      void *aWorkspace          -- USBDev Controller's workspace
 *-------------------------------------------------------------------------*/
static void LPC1768_USBDev_Disconnect(void *aWorkspace)
{
    ILPC1768_USBDev_CommandAndWrite(
        (T_LPC1768_USBDev_Workspace *)aWorkspace,
        USB_DEVICE_CMD_STATUS,
        0x00);
}

/*-------------------------------------------------------------------------*
 * Function:  LPC1768_USBDev_SetAddress
 *-------------------------------------------------------------------------*
 * Description:
 *      Sets the USB address for this device.
 * Inputs:
 *      void *aWorkspace          -- USBDev Controller's workspace
 *      TUInt8 aAddress             -- 7 bit address of this device.
 *-------------------------------------------------------------------------*/
void LPC1768_USBDev_SetAddress(void *aWorkspace, TUInt8 aAddress)
{
    ILPC1768_USBDev_CommandAndWrite(
        (T_LPC1768_USBDev_Workspace *)aWorkspace,
        USB_DEVICE_CMD_SET_ADDRESS,
        USB_DEVICE_SET_ADDRESS_ENABLE | aAddress);
    ILPC1768_USBDev_CommandAndWrite(
        (T_LPC1768_USBDev_Workspace *)aWorkspace,
        USB_DEVICE_CMD_SET_ADDRESS,
        USB_DEVICE_SET_ADDRESS_ENABLE | aAddress);
}

/*-------------------------------------------------------------------------*
 * Function:  LPC1768_USBDev_DeviceIsConfigured
 *-------------------------------------------------------------------------*
 * Description:
 *      Declare the USB Device as configured.
 * Inputs:
 *      void *aWorkspace          -- USBDev Controller's workspace
 *-------------------------------------------------------------------------*/
void LPC1768_USBDev_DeviceIsConfigured(void *aWorkspace)
{
    ILPC1768_USBDev_CommandAndWrite(
            (T_LPC1768_USBDev_Workspace *)aWorkspace,
            USB_DEVICE_CMD_CONFIG,
            USB_DEVICE_CONFIG);
}

/*-------------------------------------------------------------------------*
 * Function:  LPC1768_USBDev_DeviceIsNotConfigured
 *-------------------------------------------------------------------------*
 * Description:
 *      Declare the USB Device as NOT configured.
 * Inputs:
 *      void *aWorkspace          -- USBDev Controller's workspace
 *-------------------------------------------------------------------------*/
void LPC1768_USBDev_DeviceIsNotConfigured(void *aWorkspace)
{
    ILPC1768_USBDev_CommandAndWrite(
        (T_LPC1768_USBDev_Workspace *)aWorkspace,
        USB_DEVICE_CMD_CONFIG,
        0);
}


/*-------------------------------------------------------------------------*
 * Function:  LPC1768_USBDev_Read
 *-------------------------------------------------------------------------*
 * Description:
 *      Read data from an endpoint
 * Inputs:
 *      void *aWorkspace          -- USBDev Controller's workspace
 *      TUInt8 aEndpoint            -- Endpoint with data
 *      TUInt8 *aData               -- Pointer to place to put data.
 *      TUInt16 iMaxLen             -- Maximum number of bytes for data.
 * Outputs:
 *      TInt16                      -- Number of bytes received, or -1
 *-------------------------------------------------------------------------*/
TInt16 LPC1768_USBDev_Read(
            void *aWorkspace,
            TUInt8 aEndpoint,
            TUInt8 *aData,
            TUInt16 iMaxLen)
{
    TUInt32 aIndex = IEndpointToIndex(aEndpoint);
    TUInt32 rxLength;
    TUInt32 rxData;
    T_LPC1768_USBDev_Workspace *p = (T_LPC1768_USBDev_Workspace *)aWorkspace;

dprintf("[R %d %d]", aEndpoint, iMaxLen);
    // Setup the endpoint for reading
    LPC_USB->USBCtrl = RD_EN | ((aEndpoint & 0xF) << 2);

    // Wait for the packet to be ready (or an error)
    while (1)  {
        if ((rxLength = LPC_USB->USBRxPLen) & PKT_RDY)
            break;
    }

    // Is data valid?
    if (!(rxLength & DV))
        return -1;

